##### Pandas

In [2]:
import pandas as pd
import numpy as np

In [14]:
s = pd.Series([1,2,3,0.5,np.nan])

In [5]:
s

0    1.0
1    2.0
2    3.0
3    0.5
4    NaN
dtype: float64

In [16]:
s.dtypes

dtype('float64')

In [17]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [61]:
df = pd.DataFrame({'Name':['Raj', 'Kishor', 'Prakash','Venkat'],
                   'Age' :[1, 2,  3, 4],
                   'Salary' : [20000, np.nan, 65000, 45000]
               })

In [62]:
df

      Name  Age   Salary
0      Raj    1  20000.0
1   Kishor    2      NaN
2  Prakash    3  65000.0
3   Venkat    4  45000.0

In [45]:
df = df.dropna()

In [63]:
df

      Name  Age   Salary
0      Raj    1  20000.0
1   Kishor    2      NaN
2  Prakash    3  65000.0
3   Venkat    4  45000.0

In [65]:
df.describe()

            Age        Salary
count  4.000000      3.000000
mean   2.500000  43333.333333
std    1.290994  22546.248764
min    1.000000  20000.000000
25%    1.750000  32500.000000
50%    2.500000  45000.000000
75%    3.250000  55000.000000
max    4.000000  65000.000000